CF/AccumulationRegisters/ПродажиПоДисконтнымКартам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПоДисконтнымКартам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CF/AccumulationRegisters/БонусныеБаллы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>БонусныеБаллы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПервоначальногоНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_ОтКогоНачисленыБонусныеБаллы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CF/InformationRegisters/СостоянияОднократныхСкидокИКупонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОднократныхСкидокИКупонов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОднократныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/СостоянияОднократныхСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостоянияОднократныхСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Применена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/СтатусыДействияСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыДействияСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Comment>(Упр) Магнитные и штриховые карты.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаДляНакоплений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВладельцаКартыПоШаблону</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/WebServices/ДисконтныйСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСуммуНакопления(ИдентификаторКарты, ДатаНачала, ДатаОкончания, ИдентификаторСегмента, ИдентификаторИсключаемогоДокумента)
	
	ДисконтнаяКарта = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторКарты, "ИнформационныеКарты", "Справочник");
	МассивКарт = МаркетинговыеАкцииСервер.ПолучитьИсториюДисконтнойКарты(ДатаОкончания, ДисконтнаяКарта, Ложь);
	
	Если ЗначениеЗаполнено(ИдентификаторИсключаемогоДокумента) Тогда
		ИсключаемыйДокумент = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторИсключаемогоДокумента, "ЧекККМ", "Документ");
	Иначе
		ИсключаемыйДокумент = Документы.ЧекККМ.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторСегмента) Тогда
		СегментНоменклатуры = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторСегмента, "СегментыНоменклатуры", "Справочник");
	Иначе
		СегментНоменклатуры = Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("МассивКарт", МассивКарт);
	ПараметрыЗапроса.Вставить("ИсключаемыйДокумент", ИсключаемыйДокумент);
	ПараметрыЗапроса.Вставить("ДатаНачала", ДатаНачала);
	ПараметрыЗапроса.Вставить("ДатаОкончания", ДатаОкончания);
	ПараметрыЗапроса.Вставить("СегментНоменклатуры", СегментНоменклатуры);
	
	ДанныеНакоплений = СкидкиНаценкиСервер.ДанныеНакопленийПоКарте(ПараметрыЗапроса);
	
	СуммаНакопления = ДанныеНакоплений.СуммаНакопления;
	КоличествоНакопления = ДанныеНакоплений.КоличествоНакопления;
	
	СтрокаРезультатаЗапросаОНакопленияхТип = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "СтрокаРезультатаЗапросаОНакоплениях");
	РезультатЗапросаОНакопленияхТип = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "РезультатЗапросаОНакоплениях");
	
	РезультатЗапросаОНакоплениях = ФабрикаXDTO.Создать(РезультатЗапросаОНакопленияхТип);
	СтрокаРезультатаЗапросаОНакоплениях = ФабрикаXDTO.Создать(СтрокаРезультатаЗапросаОНакопленияхТип);
	СтрокаРезультатаЗапросаОНакоплениях.СуммаНакопления = СуммаНакопления;
	СтрокаРезультатаЗапросаОНакоплениях.КоличествоНакопления = КоличествоНакопления;
	РезультатЗапросаОНакоплениях.РезультатЗапроса.Добавить(СтрокаРезультатаЗапросаОНакоплениях);
	
	Возврат РезультатЗапросаОНакоплениях;
	
КонецФункции

Функция ПолучитьДанныеПоследнейПокупки(ИдентификаторКарты, ДатаРасчета, ИдентификаторСегмента, ИдентификаторИсключаемогоДокумента)
	
	ДисконтнаяКарта = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторКарты, "ИнформационныеКарты", "Справочник");
	МассивКарт = МаркетинговыеАкцииСервер.ПолучитьИсториюДисконтнойКарты(ДатаРасчета, ДисконтнаяКарта, Ложь);
	
	Если ЗначениеЗаполнено(ИдентификаторИсключаемогоДокумента) Тогда
		ИсключаемыйДокумент = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторИсключаемогоДокумента, "ЧекККМ", "Документ");
	Иначе
		ИсключаемыйДокумент = Документы.ЧекККМ.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторСегмента) Тогда
		СегментОтграничения = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторСегмента, "СегментыНоменклатуры", "Справочник");
	Иначе
		СегментОтграничения = Справочники.СегментыНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	ДанныеПредыдущейПокупки = СкидкиНаценкиСерверПереопределяемый.ДанныеПредыдущейПокупкиДляРасчетаСкидки(МассивКарт, ДатаРасчета, СегментОтграничения, ИсключаемыйДокумент);
	
	СтрокаРезультатаЗапросаОПоследнейПокупкеТип		 = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "СтрокаРезультатаЗапросаОПоследнейПокупке");
	РезультатЗапросаОПоследнейПокупкеТип			 = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "РезультатЗапросаОПоследнейПокупке");
	
	РезультатЗапросаОПоследнейПокупке = ФабрикаXDTO.Создать(РезультатЗапросаОПоследнейПокупкеТип);
	СтрокаРезультатаЗапросаОПоследнейПокупке = ФабрикаXDTO.Создать(СтрокаРезультатаЗапросаОПоследнейПокупкеТип);
	
	СтрокаРезультатаЗапросаОПоследнейПокупке.ДатаПокупки = ДанныеПредыдущейПокупки.Дата;
	СтрокаРезультатаЗапросаОПоследнейПокупке.СуммаНакопления = ДанныеПредыдущейПокупки.Сумма;
	СтрокаРезультатаЗапросаОПоследнейПокупке.КоличествоНакопления = ДанныеПредыдущейПокупки.Количество;
	
	РезультатЗапросаОПоследнейПокупке.РезультатЗапроса.Добавить(СтрокаРезультатаЗапросаОПоследнейПокупке);
	
	Возврат РезультатЗапросаОПоследнейПокупке;
	
КонецФункции

Функция ОбновитьДанныеОПродажах(ТипДокумента, ИдентификаторДокумента, ТаблицаТоваров)
	
	Документ = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторДокумента, ТипДокумента, "Документ");
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НаборЗаписей = РегистрыНакопления.ПродажиПоДисконтнымКартам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Документ, Истина);
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	
	ПредыдущийИдентификаторКарты = "";
	Карта = Справочники.ИнформационныеКарты.ПустаяСсылка();
	ВладелецКарты = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Для Каждого СтрокаТаблицыПродаж Из ТаблицаТоваров.СтрокиТаблицы Цикл
		
		Период = СтрокаТаблицыПродаж.Период;
		Если ПредыдущийИдентификаторКарты <> СтрокаТаблицыПродаж.ИдентификаторКарты Тогда
			Карта = ДисконтныйСервер.ОбъектПоИдентификатору(СтрокаТаблицыПродаж.ИдентификаторКарты, "ИнформационныеКарты", "Справочник");
			ВладелецКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Карта, "ВладелецКарты");
		КонецЕсли;
		Номенклатура = ДисконтныйСервер.ОбъектПоИдентификатору(СтрокаТаблицыПродаж.ИдентификаторНоменклатуры, "Номенклатура", "Справочник");
		Характеристика = ДисконтныйСервер.ОбъектПоИдентификатору(СтрокаТаблицыПродаж.ИдентификаторХарактеристики, "ХарактеристикиНоменклатуры", "Справочник");
		
		Сумма = СтрокаТаблицыПродаж.Сумма;
		Количество = СтрокаТаблицыПродаж.Количество;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Период;
		НоваяЗапись.Регистратор = Документ;
		НоваяЗапись.ДисконтнаяКарта = Карта;
		НоваяЗапись.ВладелецДисконтнойКарты = ВладелецКарты;
		НоваяЗапись.Номенклатура = Номенклатура;
		НоваяЗапись.Характеристика = Характеристика;
		НоваяЗапись.Сумма = Сумма;
		НоваяЗапись.Количество = Количество;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьОстатокБонусов(ИдентификаторКарты, ДатаЗапроса)
	
	Запрос = Новый Запрос;
	
	ДисконтнаяКарта = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторКарты, "ИнформационныеКарты", "Справочник");
	КартаДляНакоплений = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДисконтнаяКарта, "КартаДляНакоплений");
	Если ЗначениеЗаполнено(КартаДляНакоплений) Тогда
		ДисконтныеКарты = МаркетинговыеАкцииСервер.ПолучитьИсториюДисконтнойКарты(ДатаЗапроса, КартаДляНакоплений, Истина);
	Иначе
		ДисконтныеКарты = МаркетинговыеАкцииСервер.ПолучитьИсториюДисконтнойКарты(ДатаЗапроса, ДисконтнаяКарта, Истина);
	КонецЕсли;
	Запрос.УстановитьПараметр("ДисконтныеКарты", ДисконтныеКарты);
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнформационныеКарты.Ссылка КАК ДисконтнаяКарта,
	|	ИнформационныеКарты.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности
	|ПОМЕСТИТЬ КартыИПрограммы
	|ИЗ
	|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	|ГДЕ
	|	ИнформационныеКарты.Ссылка В(&ДисконтныеКарты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(БонусныеБаллы.НачисленоОстаток), 0) КАК НачисленоОстаток,
	|	ЕСТЬNULL(СУММА(БонусныеБаллы.КСписаниюОстаток), 0) КАК КСписаниюОстаток
	|ИЗ
	|	РегистрНакопления.БонусныеБаллы.Остатки(
	|			&ДатаЗапроса,
	|			(ДисконтнаяКарта, БонуснаяПрограммаЛояльности) В
	|				(ВЫБРАТЬ
	|					КартыИПрограммы.ДисконтнаяКарта,
	|					КартыИПрограммы.БонуснаяПрограммаЛояльности
	|				ИЗ
	|					КартыИПрограммы КАК КартыИПрограммы)) КАК БонусныеБаллы";
		
	Выборка = Запрос.Выполнить().Выбрать();
	ДатаОперации = 0;
	КоличествоБаллов = 0;
	Если Выборка.Следующий() Тогда
		ДатаОперации = ДатаЗапроса;
		НачисленоОстаток = ?(Выборка.НачисленоОстаток < 0, 0, Выборка.НачисленоОстаток);
		КСписаниюОстаток = ?(Выборка.КСписаниюОстаток < 0, 0, Выборка.КСписаниюОстаток);
		РазницаБаллов = НачисленоОстаток - КСписаниюОстаток;
		КоличествоБаллов = ?(РазницаБаллов < 0, 0, РазницаБаллов);
	КонецЕсли;
	СтрокаРезультатаЗапросаОБонусахТип = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "СтрокаРезультатаЗапросаОБонусах");
	РезультатЗапросаОБонусахТип = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "РезультатЗапросаОБонусах");
	
	РезультатЗапросаОБонусах = ФабрикаXDTO.Создать(РезультатЗапросаОБонусахТип);
	СтрокаРезультатаЗапросаОБонусах = ФабрикаXDTO.Создать(СтрокаРезультатаЗапросаОБонусахТип);
	СтрокаРезультатаЗапросаОБонусах.ДатаОперации = ДатаОперации;
	СтрокаРезультатаЗапросаОБонусах.КоличествоБаллов = КоличествоБаллов;
	РезультатЗапросаОБонусах.РезультатЗапроса.Добавить(СтрокаРезультатаЗапросаОБонусах);
	
	Возврат РезультатЗапросаОБонусах;
	
КонецФункции

Функция ПолучитьОстатокБонусовРасширенный(ИдентификаторКарты, ДатаЗапроса)
	
	ДисконтнаяКарта = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторКарты, "ИнформационныеКарты", "Справочник");
	ТаблицаБаллов = БонусныеБаллыСервер.ТаблицаОстаткиИДвиженияБонусныхБаллов(ДисконтнаяКарта, ДатаЗапроса);
	
	СтрокаРезультатаЗапросаОБонусахТип		 = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "СтрокаРезультатаЗапросаОБонусахРасширенного");
	РезультатЗапросаОБонусахТип			 = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "РезультатЗапросаОБонусахРасширенный");
	РезультатЗапросаОБонусах = ФабрикаXDTO.Создать(РезультатЗапросаОБонусахТип);
	
	Для Каждого СтрокаБаллов Из ТаблицаБаллов Цикл
		СтрокаРезультатаЗапросаОБонусах = ФабрикаXDTO.Создать(СтрокаРезультатаЗапросаОБонусахТип);
		СтрокаРезультатаЗапросаОБонусах.ПредставлениеПериода = СтрокаБаллов.Период;
		СтрокаРезультатаЗапросаОБонусах.КоличествоБаллов = СтрокаБаллов.Сумма;
		СтрокаРезультатаЗапросаОБонусах.Изменение = СтрокаБаллов.Изменение;
		СтрокаРезультатаЗапросаОБонусах.ТекущийОстаток = СтрокаБаллов.ТекущийОстаток;
		РезультатЗапросаОБонусах.РезультатЗапроса.Добавить(СтрокаРезультатаЗапросаОБонусах);
	КонецЦикла;
	
	Возврат РезультатЗапросаОБонусах;
	
КонецФункции

Функция ОбновитьДанныеОБонусах(ТипДокумента, ИдентификаторДокумента, ТаблицаБонусов)
	
	Документ = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторДокумента, ТипДокумента, "Документ");
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	НаборЗаписей = РегистрыНакопления.БонусныеБаллы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Документ, Истина);
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	
	Для Каждого СтрокаТаблицы Из ТаблицаБонусов.СтрокиТаблицы Цикл
		
		Карта = ДисконтныйСервер.ОбъектПоИдентификатору(СтрокаТаблицы.ИдентификаторКарты, "ИнформационныеКарты", "Справочник");
		БонуснаяПрограмма = ДисконтныйСервер.ОбъектПоИдентификатору(СтрокаТаблицы.ИдентификаторБонуснойПрограммы, "БонусныеПрограммыЛояльности", "Справочник");
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = СтрокаТаблицы.Период;
		НоваяЗапись.Регистратор = Документ;
		НоваяЗапись.ДисконтнаяКарта = Карта;
		НоваяЗапись.БонуснаяПрограммаЛояльности = БонуснаяПрограмма;
		НоваяЗапись.ВидДвижения = ?(СтрокаТаблицы.ВидДвижения = 0, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		НоваяЗапись.Начислено = СтрокаТаблицы.Начислено;
		НоваяЗапись.КСписанию = СтрокаТаблицы.КСписанию;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции

Функция ОбновитьДанныеОКупонах(ТипДокумента, ИдентификаторДокумента, ТаблицаКупонов)
	
	Документ = ДисконтныйСервер.ОбъектПоИдентификатору(ИдентификаторДокумента, ТипДокумента, "Документ");
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыПродаж Из ТаблицаКупонов.СтрокиТаблицы Цикл
		
		Период = ?(ЗначениеЗаполнено(СтрокаТаблицыПродаж.Период), СтрокаТаблицыПродаж.Период, ТекущаяДатаСеанса());
		Скидка = ДисконтныйСервер.ОбъектПоИдентификатору(СтрокаТаблицыПродаж.ИдентификаторСкидки, "СкидкиНаценки", "Справочник");
		КодКупона = СтрокаТаблицыПродаж.КодКупона;
		Состояние = СтрокаТаблицыПродаж.Состояние;
		Магазин = ДисконтныйСервер.ОбъектПоИдентификатору(СтрокаТаблицыПродаж.ИдентификаторМагазина, "Магазины", "Справочник");
		ПериодДействия = СтрокаТаблицыПродаж.ПериодДействия;
		
		Если ЗначениеЗаполнено(Скидка) И ЗначениеЗаполнено(КодКупона) Тогда
			НаборЗаписей = РегистрыСведений.СостоянияОднократныхСкидокИКупонов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Скидка.Установить(Скидка, Истина);
			НаборЗаписей.Отбор.ИдентификаторСкидки.Установить(КодКупона, Истина);
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = Период;
			НоваяЗапись.Скидка = Скидка;
			НоваяЗапись.ИдентификаторСкидки = КодКупона;
			Если ЗначениеЗаполнено(Состояние) Тогда
				НоваяЗапись.Состояние = Перечисления.СостоянияОднократныхСкидок[Состояние];
			КонецЕсли;
			НоваяЗапись.ДокументДвижения = Документ;
			НоваяЗапись.ПериодДействия = ПериодДействия;
			НоваяЗапись.Магазин = Магазин;
			
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСкидкиПоКупону(КодКупона, ДатаЗапроса)
	
	СтрокаТаблицыКупоновТип = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "СтрокаТаблицыКупонов");
	ТаблицаКупоновТип = ФабрикаXDTO.Тип("http://localhost/rt2discountservice", "ТаблицаКупонов");
	ТаблицаКупонов = ФабрикаXDTO.Создать(ТаблицаКупоновТип);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияОднократныхСкидокИКупонов.Период КАК Период,
	|	СостоянияОднократныхСкидокИКупонов.Скидка КАК Скидка,
	|	СостоянияОднократныхСкидокИКупонов.Состояние КАК Состояние,
	|	СостоянияОднократныхСкидокИКупонов.Магазин КАК Магазин,
	|	СостоянияОднократныхСкидокИКупонов.ПериодДействия КАК ПериодДействия
	|ИЗ
	|	РегистрСведений.СостоянияОднократныхСкидокИКупонов.СрезПоследних(&Период, ИдентификаторСкидки = &ИдентификаторСкидки) КАК СостоянияОднократныхСкидокИКупонов
	|ГДЕ
	|	СостоянияОднократныхСкидокИКупонов.Скидка.СтатусДействия = &Действует
	|	И СостоянияОднократныхСкидокИКупонов.Состояние = &Активна
	|	И (СостоянияОднократныхСкидокИКупонов.ПериодДействия = &ПустаяДата
	|			ИЛИ СостоянияОднократныхСкидокИКупонов.ПериодДействия >= &Период)";
	Запрос.УстановитьПараметр("Период", ДатаЗапроса);
	Запрос.УстановитьПараметр("Действует", Перечисления.СтатусыДействияСкидок.Действует);
	Запрос.УстановитьПараметр("Активна", Перечисления.СостоянияОднократныхСкидок.Активна);
	Запрос.УстановитьПараметр("ИдентификаторСкидки", КодКупона);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101000000"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицыКупонов = ФабрикаXDTO.Создать(СтрокаТаблицыКупоновТип);
		СтрокаТаблицыКупонов.Период = Выборка.Период;
		СтрокаТаблицыКупонов.ИдентификаторСкидки = Строка(Выборка.Скидка.УникальныйИдентификатор());
		СтрокаТаблицыКупонов.Состояние = Строка(Выборка.Состояние);
		СтрокаТаблицыКупонов.КодКупона = КодКупона;
		СтрокаТаблицыКупонов.ИдентификаторМагазина = Строка(Выборка.Магазин.УникальныйИдентификатор());
		СтрокаТаблицыКупонов.ПериодДействия = Выборка.ПериодДействия;
		
		ТаблицаКупонов.СтрокиТаблицы.Добавить(СтрокаТаблицыКупонов);
	КонецЦикла;
	
	Возврат ТаблицаКупонов;
	
КонецФункции

#КонецОбласти
